package com.bh.live.common.result;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 异常信息枚举类
 *
 * @author wulong
 */
@AllArgsConstructor
@Getter
public enum CodeMsg {
    SUCCESS(200, "success"),
    E_400(400,""),
    E_500(500, "请求处理异常，请稍后再试"),
    E_501(501, "参数异常"),


    /**
     * CMS-System
     */
    CMS_SYS_1000(1000, "不能操作超级管理员用户"),
    CMS_SYS_1001(1001, "用户不存在，请确认后再操作"),
    CMS_SYS_1002(1002, "用户名不能重复"),
    CMS_SYS_1003(1003, "账户信息缺失"),
    CMS_SYS_1100(1100, "不能操作超级管理员角色"),
    CMS_SYS_1101(1101, "该角色下还有其他用户，不能删除该角色"),
    CMS_SYS_1102(1102, "修改角色菜单失败，请稍后重试"),
    CMS_SYS_1103(1103, "用户类型不存在"),
    CMS_SYS_1104(1104, "注册渠道类型不存在"),


    /**************************用户登录注册类的CODE码**********************************/
    E_10004(10004, "主播不存在"),
    E_10005(10005, "当前已是主播，无需重复申请"),
    E_10006(10006, "该用户还未成为主播，请先申请"),
    E_10007(10007, "用户未注册，请先注册为平台会员再申请成为主播"),
    E_10008(10008, "手机号已注册"),
    E_10009(10009, "账户已存在"),
    E_10010(10010, "账户不存在"),
    E_10011(10011, "账号或密码错误"),
    E_10012(10012,"验证码错误"),
    E_10013(10013,"验证码已失效"),
    E_10014(10014,"验证码不存在"),
    E_10015(10015,"短信类型错误"),
    E_10016(10016,"登录失败"),
    E_10017(10017,"拖动图片获取失败"),
    E_10018(10018,"账户已废弃"),
    E_10019(10019,"账户不能登录"),
    E_10020(10020,"访问过于频繁"),
    E_10021(10021,"密码格式有误"),
    E_10022(10022, "昵称已被使用"),
    E_10023(10023,"昵称格式有误"),
    E_10024(10024,"验证码为空"),
    E_10025(10025,"验证码格式有误"),
    E_10026(10026,"用户退出登录失败"),
    E_10027(10027,"昵称已存在"),
    E_10028(10028,"昵称已经修改过"),
    E_10029(10029,"密码格式有误(限输入6-20位包含数字/字母/特殊字符任意两种)"),
    E_10030(10030,"该昵称包含敏感词"),
    E_10031(10031,"已被强制下线"),
    /**************************用户登录注册类的CODE码**********************************/

    /**************************用户验证token类的CODE码**********************************/
    E_20001(20001, "令牌已过期,请重新登陆"),
    E_20002(20002, "令牌已重置"),
    E_20003(20003, "被迫下线"),
    E_20004(20004,"未登录,请重新登录后操作"),
    E_20005(20005, "令牌校验失败"),
    E_20006(20006,"授权信息为空"),
    E_20007(20007,"令牌刷新失败"),
    E_20008(20008,"签发tokenKey失败，接口访问频率过滤器出错了"),
    E_20009(20009,"签发tokenKey失败，签发动态秘钥失败"),
    E_20010(20010,"动态秘钥解密失败"),
    E_20011(20011,"动态秘钥已过期"),
    E_20012(20012,"账户在异地或不同设备登录,请重新登录"),
    E_20013(20013,"两次密码不一致"),
    /**************************用户验证token类的CODE码**********************************/

    /**************************发送短信类的CODE码**********************************/
    /**
     * 验证码发送失败
     */
    E_30000(30000, "验证码发送失败"),
    /**
     * 当天注册短信发送次数超限
     */
    E_30001(30001, "当天%s短信发送次数超限"),
    /**************************发送短信类的CODE码**********************************/

    /**************************系统错误码相关**********************************/
    E_90003(90003, "缺少必填参数:%s"),
    E_90004(90004, "服务器异常"),
    /**************************系统错误码相关**********************************/
    /*订单验证开始***/
    /**
     * 子彩种不存在
     */
    E_50000(50000, "发布竞猜未通过验证"),
    /**
     * 竞猜内容不正确
     */
    E_50001(50001, "竞猜内容不正确"),
    /**
     * 竞猜内容格式不正确
     */
    E_50002(50002, "竞猜内容格式不正确"),
    /**
     * 竞猜内容包含不合法子玩法
     */
    E_50003(50003, "竞猜内容包含不合法子玩法"),
    /**
     * 竞猜内容包含不合法子玩法
     */
    E_50004(50004, "竞猜内容包含不合法子玩法"),
    /**
     * 竞猜内容包含不合法子玩法
     */
    E_50005(50005, "竞猜内容包含不合法子玩法"),
    E_50006(50006, "生成流水号异常"),
    E_50007(50007, "获取ip地址异常"),
    E_50008(50008, "用户ID必须输入"),
    E_50009(50009, "彩种必须输入"),
    E_50010(50010, "彩期必须输入"),
    E_50011(50011, "彩种暂停销售"),
    E_50012(50012, "彩种不存在"),
    E_50013(50013, "彩期不存在"),
    E_50014(50014, "该彩期封盘中"),
    E_50015(50015, "彩期已经销售截止"),
    E_50016(50016, "未获取到该彩种子玩法"),
    E_50017(50017, "彩种玩法未开放"),
    E_50018(50018, "未获取到该竞猜位"),
    E_50019(50019, "竞猜位未开放"),
    E_50020(50020, "您被禁止发布竞猜，具体原因请联系客服！"),
    E_50021(50021, "该彩期未到发布竞猜时间"),
    E_50022(50022, "竞猜内容包含未开放玩法"),
    E_50023(50023, "两面玩法不能竞猜2个选项"),
    E_50024(50024, "三全中与三中二玩法最少竞猜3个选项"),
    E_50025(50025, "竞猜内容格式不正确，有重复值！"),
    E_50026(50026, "竞猜内容格式不正确！"),
    E_50027(50027, "本期已发布竞猜"),
    /*订单验证结束***/

    /*******************************交易验证begin******************/
    E_50100(50100, "账户交易冻结，具体请联系客服"),
    E_50101(50101, "账户余额不足，请及时充值！"),
    E_50102(50102, "违规操作！！！"),
    E_50103(50103, "交易类型不存在"),
    E_50104(50104, "交易失败"),
    E_50105(50105, "竞猜不存在"),
    E_50106(50106, "请勿重复购买同一竞猜"),
    E_50107(50107, "销售时间已过，不能再购买"),
    E_50108(50108, "交易金额未输入"),
    E_50109(50109, "必须指明交易类型"),
    E_50110(50110, "交易流水不存在"),
    E_50111(50111, "用户id不能为空"),
    E_50112(50112, "收入支出状态不能为空"),
    E_50113(50113, "交易类型不能为空"),
    E_50114(50114, "操作人员id不能为空"),
    E_50115(50115, "交易金额不能为空"),
    E_50116(50116, "账户总余额不能为空"),
    E_50117(50117, "提现额度超出可提现余额"),
    E_50118(50118, "交易失败"),
    /*******************************交易验证end******************/



    /**************************图片上传相关**********************************/
    E_40001(40001, "图片不能为空"),
    E_40002(40002, "图片不能大于5M"),
    E_40003(40003, "竞猜位未开放"),
    /**************************图片上传相关**********************************/

    /** 彩种 start **/
    E_60000(60000,"彩种不存在"),
    E_60001(60001,"玩法不存在"),
    E_60002(60002,"默认玩法不存在"),
    E_60101(60101,"隐藏设置参数错误"),
    E_60102(60102,"玩法类型参数错误"),
    E_60202(60202,"未找到彩种当前彩期"),
    /** 彩种 end **/

    /**
     *时间类型参数错误
     */
    E_70001(70001,"时间类型参数错误"),

    /**************************开奖派奖**********************************/
    E_80001(80001,"原型模式创建对象失败"),
    E_80002(80002,"此彩种彩期正在执行"),
    E_80003(80003,"不存在开奖服务类"),
    E_80004(80004,"奖项不存在对应的中奖金额"),
    E_80005(80005,"票玩法类型错误，不能计算开奖"),
    E_80006(80006,"重庆时时彩开奖计算方式不存在"),
    E_80007(80007,"彩种彩期不存在"),
    E_80008(80008,"开奖号码为空"),
    E_80009(80009,"不存在该玩法"),
    E_80010(80010,"不存在该投注位"),
    E_80011(80011,"不存在该赔率"),
    E_80012(80012,"不存在该投注项"),
    E_80013(80013,"彩期期号不能为空"),
    E_80014(80014,"彩种编号不能为空"),
    E_80015(80015,"未查询到符合开奖的订单"),
    E_80016(80016,"不存在投注位"),
    E_80017(80017,"未查询到彩种对应的彩期"),
    E_80018(80018,"操作的%s与彩种彩期状态：%s，不符"),
    E_80019(80019,"开奖类型不匹配"),
    E_80020(80020,"彩种:%s,彩期:%s,不能自动开奖"),
    E_80021(80021,"彩种编号不能为空"),
    E_80022(80022,"%s开奖失败"),
    /**************************开奖派奖**********************************/

    /**********************************CMS后台异常*****************************/
    E_100001(100001,"帐号处于异常状态,请联系超级管理员进行处理"),
    E_100002(100002,"用户组发布方案为空"),
    E_100003(100003,"用户方案价格设定为空"),
    E_100004(100004,"可见用户组"),
    E_100005(100005,"彩种已经存在，无需配置"),
    E_100006(100006,"查询列表数据为空"),

    /**********************************CMS后台异常*****************************/
    /**
     * 聊天室发言
     */
    E_90001(90001,"消息发送失败,请重新发送"),
    E_90002(90002,"该用户已被禁言"),
    E_90010(90010,"获取Token失败"),
    E_90011(90011,"Token失效,请重新连接"),
    E_90012(90012,"Websoket 连接失败")
    ;

    public int code;
    public String message;
}
